<?php
	include"UyghurCharUtilities2.class.php";
include"UyghurCharUtilities.class.php";

	$str='جۇڭگو تورى 13-نويابىر خەۋىرى: فىرانسىيە فىكالو گېزىتى تور پونكىتىنىڭ 11-نويابىردىكى خەۋىرىگە ئاساسلانغاندا، سۇرىيە دۆلەتلىك تېلېۋېزىيە ئىستانسسىنىڭ بەرگەن خەۋىرىگە ئاساسلانغاندا دەمەشىق شەھەر مەركىزىگە جايلاشقان خىرىستىيان شاگىرتلىرىنى تەربىيلەشنى ئاساس قىلغان بىر مەكتەپ توپ ئوقى زەربىسىگە ئۇچراپ، بەش نەپەر ئۆسمۈر قازا قىلغان.
سۇرىيە قانىلى خەۋىرىدە مۇنداق دېگەن: ئەينى ۋاقىتتا توپ ئوقى مەكتەپ ئىچىگە چۈشكەن بولۇپ، ھېچقانداق بىشارەت بولمىغان. بەش نەپەر ئۆسمۈر مۇشۇ سەۋەپتىن قازا قىلغان، يەنە 27 ئادەم ئېغىر يارلانغان. ئىگىلىنىشىچە، تېرورچى ئۇنسۇرلارنىڭ بۇ توپ ئوقىنى قويۇپ بەرگەنلىكى جەزىملەشتۈرۈلگەن.
بۇندىن ئىلگىرى سۇرىيە al-Ikhbariya تېلېۋېزىيە ئىستانسسى خەۋەر بېرىپ مۇنداق دېگەن: ئىچكى ئىشلار مىنىستىرلىقىنىڭ سۆزىگە ئاساسلانغاندا، تېررورچى ئۇنسۇرلار ئالدى بىلەن مەكتەپكە توغرىلاپ بىر توپ ئوقى قويۇپ بېرىپ 11 نەپەر ئوقۇغۇچىنى يارلاندۇرغان، ئاندىن يەنە بىر مەكتەپ ئاپتومۇبىلىغا قارىتىپ يەنە بىر توپ ئوقى قويۇپ بېرىپ بەش نەپەر ئوقۇغۇچىنىڭ ئېغىر يارلىنىشىنى كەلتۈرۈپ چىقارغان.
يېقىنقى بىر قانچە ئايدىن بۇيان سۇرىيە پايتەختى دەمەشىقنىڭ ھەر قايسى رايونلىرى دائىم دېگۈدەك توپ ئوقى ھۇجۇمىغا ئۇچراپ كەلدى، يېقىندا سۇرىيە ھۆكۈمىتى تېررورچىلارنى قولغا ئالغان.';
	
	$time = microtime();
	$u = new UyghurCharUtilities();

$temp = $u->getUyPFStr($str.$str.$str.$str.$str.$str.$str.$str.$str.$str);

//UyghurCharUtilities::getUyPFStr($str.$str.$str.$str.$str.$str.$str.$str.$str.$str);

echo  microtime() -$time . "\n";


$time = microtime();
//	$u = new UyghurCharUtilities();
//
//$temp = $u->getUyPFStr($str.$str.$str.$str.$str.$str.$str.$str.$str.$str);

$u = new UyghurCharUtilities2();

$temp = $u->getUyPFStr($str.$str.$str.$str.$str.$str.$str.$str.$str.$str);

echo  microtime() -$time;

//echo "<br><br><br><br>\n";
//echo $u->getUyBRStr($temp);
//echo "<br><br><br><br>\n";
//echo $u->getUyULYStr($str);
//echo "<br><br><br><br>\n";
?>
